run/fsiFoam/HronTurekFsi3/fluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fsiFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2.04;

deltaT          1e-3;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.2;

functions
(
   pointHistory
   {
       type pointHistory;
       functionObjectLibs
       (
         "libpointHistory.so"
       );

       region solid;

       refHistoryPoint (0.6 0.2 0.025334);
   }

   hronTurekReport
   {
       type hronTurekReport;
       functionObjectLibs
       (
         "libhronTurekReport.so"
       );
   }
);


// ************************************************************************* //
